## DDL COMMANDS

DDL or Data Definition Language actually consists of the SQL commands that can be used to define the database schema. It simply deals with descriptions of the database schema and is used to create and modify the structure of database objects in the database.DDL is a set of SQL commands used to create, modify, and delete database structures but not data. These commands are normally not used by a general user, who should be accessing the database via an application.

List of DDL commands: 
- CREATE: This command is used to create the database or its objects (like table, index, function, views, store procedure, and triggers).
- DROP: This command is used to delete objects from the database.
- ALTER: This is used to alter the structure of the database.
- TRUNCATE: This is used to remove all records from a table, including all spaces allocated for the records are removed.
- COMMENT: This is used to add comments to the data dictionary.
- RENAME: This is used to rename an object existing in the database.

In [1]:
#Load The SQL Magic
%load_ext sql

In [2]:
#Establish Connection with the database.
%sql sqlite:///../Databases/chinook.db

#### Discuss Each and every DDL Command with examples.

### 1. CREATE
- This command is used to create the database or its objects (like table, index, function, views, store procedure, and triggers).

In [9]:
%%sql
CREATE TABLE STUDENT
(
first_name varchar(20),
last_name varchar(20),
school varchar(20)
);

 * sqlite:///../Databases/chinook.db
Done.

[]

In [15]:
%sql Select * from STUDENT;

 * sqlite:///../Databases/chinook.db
Done.

[]

## 2. ALTER
- This is used to alter the structure of the database.

#### 1. Add a new column in the table.

In [16]:
%%sql
ALTER TABLE STUDENT ADD class int;

 * sqlite:///../Databases/chinook.db
Done.

[]

In [17]:
%sql Select * from STUDENT;

 * sqlite:///../Databases/chinook.db
Done.

[]

#### 2. Add Multiple Columns In The Table.

```sql
ALTER TABLE STUDENT
ADD COLUMN age int,
ADD COLUMN address varchar(100);

OR

ALTER TABLE STUDENT
ADD
(
    age int,
    address varchar(100)
)
```
SQlite not supports multiple columns at once. [check here]('https://www.sqltutorial.org/sql-add-column/')

#### 3. modify column `class` to `student_class`
- `MODIFY`:The MODIFY clause allows you to change some attributes of the existing column e.g., NOT NULL ,UNIQUE, and data type.

```sql
ALTER TABLE STUDENT
MODIFY class varchar(30);
```
That's one of the better-known drawbacks of SQLite (no MODIFY COLUMN support on ALTER TABLE), but it's on the list of SQL features that SQLite does not implement.
https://stackoverflow.com/questions/2685885/sqlite-modify-column#:~:text=SQLite%20Modify%20Column%201%20Create%20a%20new%20table,4%20Rename%20new%20table%20to%20old%20tables%20name

#### 4. Drop Column `class`

In [36]:
%%sql
ALTER TABLE STUDENT
DROP class;

 * sqlite:///../Databases/chinook.db
Done.

[]

In [37]:
%sql Select * from STUDENT;

 * sqlite:///../Databases/chinook.db
Done.

[]

#### 5. Drop Multiple Columns

In [ ]:
%%sql
ALTER TABLE STUDENT
DROP(school,last_name);

OR

ALTER TABLE STUDENT
DROP school,
DROP last_name

#### 6. Rename column Name

In [41]:
%%sql
ALTER TABLE STUDENT
RENAME school to school_name;

 * sqlite:///../Databases/chinook.db
Done.

[]

In [42]:
%sql Select * from STUDENT;

 * sqlite:///../Databases/chinook.db
Done.

[]

## 3. RENAME
- This is used to rename an object existing in the database.

#### 1. Rename Table name

In [40]:
%%sql
RENAME TABLE STUDENT TO STUDENT_INFO;

 * sqlite:///../Databases/chinook.db
(sqlite3.OperationalError) near "RENAME": syntax error
[SQL: RENAME TABLE STUDENT TO STUDENT_INFO;]
(Background on this error at: http://sqlalche.me/e/e3q8)

## 4. DROP
- Drop the table from the database.

#### 1. Drop Table.

In [43]:
%%sql
DROP TABLE STUDENT;

 * sqlite:///../Databases/chinook.db
Done.

[]

In [44]:
%sql Select * from STUDENT;

 * sqlite:///../Databases/chinook.db
(sqlite3.OperationalError) no such table: STUDENT
[SQL: Select * from STUDENT;]
(Background on this error at: http://sqlalche.me/e/e3q8)

## 5. TRUNCATE
- used to delete the data from the table.
- TRUNCATE is another DDL command which deletes or removes all the records from the table.

In [45]:
%%sql
TRUNCATE TABLE STUDENT;

 * sqlite:///../Databases/chinook.db
(sqlite3.OperationalError) near "TRUNCATE": syntax error
[SQL: TRUNCATE TABLE STUDENT;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [48]:
%%sql
DECLARE NAME VARCHAR(20)
SET NAME="TRILOK"
SELECT @NAME;

 * sqlite:///../Databases/chinook.db
(sqlite3.OperationalError) near "DECLARE": syntax error
[SQL: DECLARE NAME VARCHAR(20)
SET NAME="TRILOK"
SELECT @NAME;]
(Background on this error at: http://sqlalche.me/e/e3q8)